

def menu():
    districts = ['Ευβοϊκός','Κρήτη','Θερμαϊκός', 'Νησιά Αιγαίου','Θρακικό Πέλαγος','Νότια Πελοπόννησος',
                 'Ιόνιο','Πατραϊκός - Κορινθιακός','Κεντρική Ελλάδα','Σαρωνικός']
    while True:
        print('1.Ευβοϊκός')
        print('2.Κρήτη')
        print('3.Θερμαϊκός')
        print('4.Νησιά Αιγαίου')
        print('5.Θρακικό Πέλαγος')
        print('6.Νότια Πελοπόννησος')
        print('7.Ιόνιο')
        print('8.Πατραϊκός - Κορινθιακός')
        print('9.Κεντρική Ελλάδα')
        print('10.Σαρωνικός')
        try:
            choice = int(input("\nΠαρακαλώ εισάγετε την επιλογή σας:"))
            if choice in range(1,11):break
            else:print("Εισάγετε 1 η 2.")
        except ValueError:
            print("Σφάλμα.\n")


    return districts[choice - 1]
